fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>DefinedType.ВКМ_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>СуммаПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>НДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ВКМ_Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
  
  Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	  
	  Для Каждого Строка Из СписокСотрудников Цикл 
		  
		  Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		  Движение.ВидРасчета = Строка.ВидРасчета;
		  Движение.Сторно = Ложь;
		  Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		  Движение.ПериодДействияКонец = КонецМесяца(Дата);
		  Движение.ПериодРегистрации = Дата;
		  Движение.Сотрудник = Строка.Сотрудник;
		  Движение.Подразделение = Строка.Подразделение;
		  Движение.СуммаПремии = Строка.СуммаПремии;
		  Движение.НДФЛ = Движение.СуммаПремии * 13 / 100;
		  
		  ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
		  ДвижениеУдержание.ПериодРегистрации = Дата;
		  ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		  ДвижениеУдержание.Сторно = Ложь;
		  ДвижениеУдержание.ПериодДействияНачало = НачалоМесяца(Дата);
		  ДвижениеУдержание.ПериодДействияКонец = КонецМесяца(Дата);
		  ДвижениеУдержание.Сотрудник = Строка.Сотрудник;
		  ДвижениеУдержание.Подразделение = Строка.Подразделение;
		  ДвижениеУдержание.НДФЛ = Движение.НДФЛ; 
		  
		  ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		  ДвижениеВзаиморасчеты.Сотрудник = Строка.Сотрудник;
		  ДвижениеВзаиморасчеты.Период = Дата;
		  
		 		  
	  КонецЦикла;
	  
	  Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	  Движения.ВКМ_Удержания.Записать();
	  Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	  
	  ВзаиморасчетыССотрудниками();
    	  
  КонецПроцедуры 
#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции 
 
  Процедура ВзаиморасчетыССотрудниками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.СуммаПремии, 0)) КАК СуммаПремии,
		|	СУММА(ЕСТЬNULL(ВКМ_Удержания.НДФЛ, 0)) КАК НДФЛ,
		|	ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками КАК ВКМ_ВзаиморасчетыССотрудниками
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки = ВКМ_Удержания.НомерСтроки
		|		И ВКМ_ВзаиморасчетыССотрудниками.Регистратор = ВКМ_Удержания.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки = ВКМ_ДополнительныеНачисления.НомерСтроки
		|		И ВКМ_ВзаиморасчетыССотрудниками.Регистратор = ВКМ_ДополнительныеНачисления.Регистратор
		|ГДЕ
		|	ВКМ_ВзаиморасчетыССотрудниками.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудниками.Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудниками.НомерСтроки";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками[Выборка.НомерСтроки - 1];
		Движение.Сумма = Выборка.СуммаПремии - Выборка.НДФЛ; 
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли
